dinnect/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."title" = ? LIMIT 1  [["title", "Star Wars"]]
---
  def search
    @movie = Movie.find_by_title(params[:title])