dinnect/app/controllers/sessions_controller.rb

  def create
    user = User.find_by(username: params[:session][:username_or_email]) ||
           User.find_by(email: params[:session][:username_or_email])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "uncch"], ["LIMIT", 1]]